4Alisa/9/AccumulationRegisters/РезервыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>РезервыТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПартияРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РезервированиеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

4Alisa/9/Documents/РезервированиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>РезервированиеТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьТолькоВНаличии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

4Alisa/9/CommonModules/омРезервыСервер/Ext/Module.bsl
&НаСервере
// Режим 1 - возврат запроса с учетом списка  товаров
// Режим 2 - возврат запроса по всем резервам контрагента
Функция ПолучитьТекстЗапросаПоРезервам(Режим = 1)
	Перем текстЗапроса;
	
	Если Режим = 1 Тогда
		текстЗапроса = "ВЫБРАТЬ
		               |	РезервыТоваровОстатки.Товар,
		               |	РезервыТоваровОстатки.ПартияРезерва,
		               |	РезервыТоваровОстатки.Контрагент,
		               |	СУММА(РезервыТоваровОстатки.КоличествоОстаток) КАК Количество
		               |ИЗ
		               |	РегистрНакопления.РезервыТоваров.Остатки(
		               |			,
		               |			Контрагент = &Контрагент
		               |				И ПартияРезерва = &ПартияРезерва) КАК РезервыТоваровОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РезервыТоваровОстатки.Товар,
		               |	РезервыТоваровОстатки.ПартияРезерва,
		               |	РезервыТоваровОстатки.Контрагент";
	Иначе
		текстЗапроса = "ВЫБРАТЬ
		               |	РезервыТоваровОстатки.Товар,
		               |	РезервыТоваровОстатки.ПартияРезерва,
		               |	РезервыТоваровОстатки.Контрагент,
		               |	СУММА(РезервыТоваровОстатки.КоличествоОстаток) КАК Количество
		               |ИЗ
		               |	РегистрНакопления.РезервыТоваров.Остатки(
		               |			,
					   |			Контрагент = &Контрагент
					   //|				И ПартияРезерва = &ПартияРезерва
					   | ) КАК РезервыТоваровОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РезервыТоваровОстатки.Товар,
		               |	РезервыТоваровОстатки.ПартияРезерва,
		               |	РезервыТоваровОстатки.Контрагент";		
	КонецЕсли;
	
	Возврат(текстЗапроса);
КонецФункции

&НаСервере
Процедура ПолучитьРезервыПоДокументуОснованию(Контрагент, ДокументОснование = Неопределено, сзСписокТоваров = Неопределено, Отказ=ЛОЖЬ)	Экспорт
	РежимЗапроса = 1;
	Если ДокументОснование = Неопределено 
		ИЛИ ДокументОснование = NULL 
			ИЛИ ДокументОснование = Документы.РезервированиеТоваров.ПустаяСсылка() 
	Тогда
		РежимЗапроса  = 2 ;
	КонецЕсли;
	
	ТекстЗапроса = ПолучитьТекстЗапросаПоРезервам(РежимЗапроса);
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ПартияРезерва",ДокументОснование);
	// Проверка на тип параметра сзСписокТоваров
	Если 
		сзСписокТоваров = Неопределено
		ИЛИ сзСписокТоваров = NULL
			ИЛИ (НЕ (Тип("СписокЗначений") = ТипЗнч(сзСписокТоваров)))
	Тогда    
		Возврат;
	КонецЕсли;
	
	РЗапроса = Запрос.Выполнить();	
	ВЗапроса = РЗапроса.Выбрать();
	Пока ВЗапроса.Следующий() Цикл
		СтруктураРезерва = Новый Структура("ПартияРезерва, Контрагент, Товар, Количество");
		ЗаполнитьЗначенияСвойств(СтруктураРезерва, ВЗапроса);
		сзСписокТоваров.Добавить(СтруктураРезерва);
	КонецЦикла;
	
КонецПроцедуры
